eir_pilot_sample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:ns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/">
  <soapenv:Header>
    <cai3:SessionId>$SESSION_ID</cai3:SessionId>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Create>
      <cai3:MOType>IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</cai3:MOType>
      <cai3:MOId>
        <ns:subscriberId>pVIM8811574_TG1@ngv.eircom.net</ns:subscriberId>
      </cai3:MOId>
      <cai3:MOAttributes>
        <ns:createIMSSubscription subscriberId="pVIM8811574_TG1@ngv.eircom.net">
          <ns:subscriberId>pVIM8811574_TG1@ngv.eircom.net</ns:subscriberId>
          <ns:subscriberBarringInd>FALSE</ns:subscriberBarringInd>
          <ns:pubData publicIdValue="sip:pVIM8811574_TG1@ngv.eircom.net">
            <ns:publicIdValue>sip:pVIM8811574_TG1@ngv.eircom.net</ns:publicIdValue>
            <ns:privateUserId>pVIM8811574_TG1@ngv.eircom.net</ns:privateUserId>
            <ns:xcapAllowed>FALSE</ns:xcapAllowed>
            <ns:implicitRegSet>1</ns:implicitRegSet>
            <ns:isDefault>TRUE</ns:isDefault>
            <ns:configuredServiceProfiles configuredServiceProfileId="siptrunk_orig_invite_reg_retail">
              <ns:configuredServiceProfileId>siptrunk_orig_invite_reg_retail</ns:configuredServiceProfileId>
            </ns:configuredServiceProfiles>
          </ns:pubData>
          <ns:privateUser privateUserId="pVIM8811574_TG1@ngv.eircom.net">
            <ns:privateUserId>pVIM8811574_TG1@ngv.eircom.net</ns:privateUserId>
            <ns:userPassword>LEEDS</ns:userPassword>
            <ns:roamingAllowed>FALSE</ns:roamingAllowed>
            <ns:allowedAuthMechanism>Digest</ns:allowedAuthMechanism>
          </ns:privateUser>
        </ns:createIMSSubscription>
      </cai3:MOAttributes>
    </cai3:Create>
  </soapenv:Body>
</soapenv:Envelope>